items_1 = {
    "Монета Хомяк": [1, 1],
    "Мокасины AbiBoss": [50, 40],
    "Робакс": [2, 2],
    "Набор Лего": [10, 8],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [6, 6],
    "Акции Татнефть": [11, 11],
    "Акции Газпрома": [10, 10],
}

items_2 = {
    "Монета Хомяк": [1.1, 1.1],
    "Мокасины AbiBoss": [52, 40],
    "Робакс": [2, 2],
    "Набор Лего": [14, 12],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [6, 6],
    "Акции Татнефть": [13, 13],
    "Акции Газпрома": [12, 12],
}

items_3 = {
    "Монета Хомяк": [1.2, 1.2],
    "Мокасины AbiBoss": [54, 40],
    "Робакс": [2, 2],
    "Набор Лего": [18, 16],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [6, 6],
    "Акции Татнефть": [15, 15],
    "Акции Газпрома": [14, 14],
}

items_4 = {
    "Монета Хомяк": [0.8, 0.8],
    "Мокасины AbiBoss": [56, 40],
    "Робакс": [2, 2],
    "Набор Лего": [24, 21],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [18, 15],
    "NFT 'Мем с котом'": [6, 6],
    "Акции Татнефть": [18, 18],
    "Акции Газпрома": [17, 17],
}

items_5 = {
    "Монета Хомяк": [0.5, 0.5],
    "Мокасины AbiBoss": [60, 50],
    "Робакс": [2, 2],
    "Набор Лего": [30, 25],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [18, 15],
    "NFT 'Мем с котом'": [6, 6],
    "Акции Татнефть": [15, 15],
    "Акции Газпрома": [14, 14],
}

items_6 = {
    "Монета Хомяк": [0, 0],
    "Мокасины AbiBoss": [60, 50],
    "Робакс": [2, 2],
    "Набор Лего": [30, 25],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [18, 15],
    "NFT 'Мем с котом'": [6, 6],
    "Акции Татнефть": [16, 16],
    "Акции Газпрома": [15, 15],
}

items_7 = {
    "Монета Хомяк": [0, 0],
    "Мокасины AbiBoss": [60, 50],
    "Робакс": [3, 3],
    "Набор Лего": [32, 26],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [25, 20],
    "NFT 'Мем с котом'": [25, 25],
    "Акции Татнефть": [11, 11],
    "Акции Газпрома": [10, 10],
}

items_8 = {
    "Монета Хомяк": [0, 0],
    "Мокасины AbiBoss": [70, 50],
    "Робакс": [3, 3],
    "Набор Лего": [40, 28],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [25, 20],
    "NFT 'Мем с котом'": [34, 34],
    "Акции Татнефть": [19, 19],
    "Акции Газпрома": [18, 18],
}

items_9 = {
    "Монета Хомяк": [0, 0],
    "Мокасины AbiBoss": [80, 50],
    "Робакс": [3, 3],
    "Набор Лего": [40, 34],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [25, 20],
    "NFT 'Мем с котом'": [14, 14],
    "Акции Татнефть": [22, 22],
    "Акции Газпрома": [20, 20],
}

items_10 = {
    "Монета Хомяк": [0, 0],
    "Мокасины AbiBoss": [90, 50],
    "Робакс": [3, 3],
    "Набор Лего": [45, 40],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [27, 23],
    "NFT 'Мем с котом'": [9, 9],
    "Акции Татнефть": [18, 18],
    "Акции Газпрома": [17, 17],
}

items_11 = {
    "Монета Хомяк": [0, 0],
    "Мокасины AbiBoss": [100, 50],
    "Робакс": [3, 3],
    "Набор Лего": [47, 41],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [27, 24],
    "NFT 'Мем с котом'": [7, 7],
    "Акции Татнефть": [23, 23],
    "Акции Газпрома": [21, 21],
}

items_12 = {
    "Монета Хомяк": [0, 0],
    "Мокасины AbiBoss": [100, 50],
    "Робакс": [3, 3],
    "Набор Лего": [50, 44],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [29, 24],
    "NFT 'Мем с котом'": [7, 7],
    "Акции Татнефть": [25, 25],
    "Акции Газпрома": [24, 24],
}

class Items:
    def __init__(self, round_number=1):
        self.items = [items_1, items_2, items_3, items_4, items_5, items_6,
                      items_7, items_8, items_9, items_10, items_11, items_12]
        self.round_number = round_number

    def get_items_list(self):
        return list(self.items[self.round_number - 1].keys())

    def get_price(self, item_name, is_buy=True):
        is_buying = 0 if is_buy else 1
        return self.items[self.round_number - 1][item_name][is_buying]

items = Items(1)
