items_1 = {
    "Хомяк": 1,
    "Чипсы Лэйк": 5,
    "Бульмени": 10,
    "Робакс": 2,
    "Злой Кола": 3,
    "Телега премиум": 10,
    "Скины в КС ГО": 10
}

items_2 = {
    "Хомяк": 1,
    "Чипсы Лэйк": 4,
    "Бульмени": 9,
    "Робакс": 2,
    "Злой Кола": 2,
    "Телега премиум": 8,
    "Скины в КС ГО": 9,
}

items_3 = {
    "Хомяк": 1,
    "Чипсы Лэйк": 4,
    "Бульмени": 9,
    "Робакс": 2,
    "Злой Кола": 2,
    "Телега премиум": 8,
    "Скины в КС ГО": 9,
}

items_4 = {
    "Хомяк": 0,
    "Чипсы Лэйк": 3,
    "Бульмени": 8,
    "Робакс": 1,
    "Злой Кола": 2,
    "Телега премиум": 7,
    "Скины в КС ГО": 8,
}

items_5 = {
    # "Хомяк": 0,
    "Чипсы Лэйк": 2,
    "Бульмени": 7,
    "Робакс": 0,
    "Злой Кола": 2,
    "Телега премиум": 7,
    "Скины в КС ГО": 8,
}

items_6 = {
    "Хомяк": 0,
    "Чипсы Лэйк": 0,
    "Бульмени": 0,
    "Робакс": 0,
    "Злой Кола": 0,
    "Телега премиум": 0,
    "Скины в КС ГО": 7,
}

items_6 = {
    "кроссовки Лайк Эйр": 50,
    "Кайф-фон-16": 70,
    "Сансунг Зе-флот": 70,
    "Наоми Редми Нод": 30,
    "Акции СБЕРа": 10,
    "Акции Газпрома": 5,
    "Акции Яндекса": 10,
    "Акции Лукойла": 25,
}

items_7 = {
    "кроссовки Лайк Эйр": 45,
    "Кайф-фон-16": 60,
    "Сансунг Зе-флот": 50,
    "Наоми Редми Нод": 20,
    "Акции СБЕРа": 9,
    "Акции Газпрома": 4,
    "Акции Яндекса": 8,
    "Акции Лукойла": 26,
}

items_8 = {
    "кроссовки Лайк Эйр": 35,
    "Кайф-фон-16": 50,
    "Сансунг Зе-флот": 30,
    "Наоми Редми Нод": 10,
    "Акции СБЕРа": 11,
    "Акции Газпрома": 6,
    "Акции Яндекса": 13,
    "Акции Лукойла": 30,
}

items_9 = {
    "кроссовки Лайк Эйр": 20,
    "Кайф-фон-16": 40,
    "Сансунг Зе-флот": 25,
    "Наоми Редми Нод": 5,
    "Акции СБЕРа": 8,
    "Акции Газпрома": 7,
    "Акции Яндекса": 20,
    "Акции Лукойла": 25,
}

items_10 = {
    "кроссовки Лайк Эйр": 10,
    "Кайф-фон-16": 10,
    "Сансунг Зе-флот": 5,
    "Наоми Редми Нод": 1,
    "Акции СБЕРа": 15,
    "Акции Газпрома": 13,
    "Акции Яндекса": 23,
    "Акции Лукойла": 35,
}


class Items:
    def __init__(self, round_number=1):
        self.items = [items_1, items_2, items_3, items_4,items_5,items_6, items_7, items_8, items_9, items_10]
        self.round_number = round_number

    def get_items_list(self):
        return list(self.items[self.round_number - 1].keys())

    def get_price(self, item_name):
        return self.items[self.round_number - 1][item_name]

items = Items(1)
