items_1 = {
    "Монета Хомяк": [1, 1],
    "Чипсы Лэйк": [5, 5],
    "Робакс": [2, 2],
    "Злой кола": [3, 3],
    "Набор Лего": [10, 10],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [6, 6],
    "Скины КС:ГО ": [10, 10]
}

items_2 = {
    "Монета Хомяк": [1, 1],
    "Чипсы Лэйк": [5, 3],
    "Робакс": [2, 2],
    "Злой кола": [3, 2],
    "Набор Лего": [12, 11],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [5, 5],
    "Скины КС:ГО ": [7, 7],
    "AbiBoss": [20, 20]
}

items_3 = {
    "Монета Хомяк": [1.2, 1.2],
    "Чипсы Лэйк": [5, 2],
    "Робакс": [3, 3],
    "Злой кола": [3, 1],
    "Набор Лего": [13, 11],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [6, 6],
    "Скины КС:ГО ": [8, 8],
    "AbiBoss": [22, 20]
}

items_4 = {
    "Монета Хомяк": [1.3, 1.3],
    "Чипсы Лэйк": [5, 1],
    "Робакс": [4, 4],
    "Злой кола": [3, 1],
    "Набор Лего": [14, 12],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [6, 6],
    "Скины КС:ГО ": [9, 9],
    "AbiBoss": [24, 19]
}

items_5 = {
    "Монета Хомяк": [0.5, 0.5],
    "Чипсы Лэйк": [5, 1],
    "Робакс": [1, 1],
    "Злой кола": [3, 1],
    "Набор Лего": [15, 13],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [6, 6],
    "Скины КС:ГО ": [9, 9],
    "AbiBoss": [24, 19]
}

items_6 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [16, 13],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [8, 8],
    "Скины КС:ГО ": [10, 10],
    "AbiBoss": [25, 20]
}

items_7 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [17, 14],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [12, 12],
    "Скины КС:ГО ": [15, 15],
    "AbiBoss": [25, 20],
    "Кайф-фон-16":[100, 95],
    "Акции Татнефть": [10, 10],
    "Акции Газпрома": [15, 15],
    "Акции Яндекса": [20, 20],
    "Акции СБЕРа": [25, 25],
}

items_8 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [18, 16],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [14, 14],
    "Скины КС:ГО ": [17, 17],
    "AbiBoss": [30, 18],
    "Кайф-фон-16":[100, 95],
    "Акции Татнефть": [8, 8],
    "Акции Газпрома": [12, 12],
    "Акции Яндекса": [18, 18],
    "Акции СБЕРа": [21, 21],
}

items_9 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [19, 17],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [15, 15],
    "Скины КС:ГО ": [17, 17],
    "AbiBoss": [29, 17],
    "Кайф-фон-16":[110, 85],
    "Акции Татнефть": [6, 6],
    "Акции Газпрома": [10, 10],
    "Акции Яндекса": [15, 15],
    "Акции СБЕРа": [17, 17],
}

items_10 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [20, 18],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [10, 10],
    "Скины КС:ГО ": [12, 12],
    "AbiBoss": [25, 15],
    "Кайф-фон-16":[110, 85],
    "Акции Татнефть": [5, 5],
    "Акции Газпрома": [9, 9],
    "Акции Яндекса": [14, 14],
    "Акции СБЕРа": [16, 16],
}

items_11 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [21, 18],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [5, 5],
    "Скины КС:ГО ": [4, 4],
    "AbiBoss": [25, 15],
    "Кайф-фон-16":[110, 85],
    "Акции Татнефть": [7, 7],
    "Акции Газпрома": [11, 11],
    "Акции Яндекса": [15, 15],
    "Акции СБЕРа": [18, 18],
}

items_12 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [22, 20],
    "МасБук": [150, 150],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [1, 1],
    "Скины КС:ГО ": [3, 3],
    "AbiBoss": [25, 15],
    "Кайф-фон-16":[110, 85],
    "Акции Татнефть": [9, 9],
    "Акции Газпрома": [13, 13],
    "Акции Яндекса": [14, 14],
    "Акции СБЕРа": [21, 21],
}

items_13 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [24, 21],
    "МасБук": [150, 140],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [1.5, 1.5],
    "Скины КС:ГО ": [2, 2],
    "AbiBoss": [25, 15],
    "Кайф-фон-16":[110, 85],
    "Картина Лизы":[1000, 1000],
    "Айфон 1":[600, 600],
    "Часы Патэк":[700, 700],
    "Акции Татнефть": [12, 12],
    "Акции Газпрома": [15, 15],
    "Акции Яндекса": [16, 16],
    "Акции СБЕРа": [22, 22],
}

items_14 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [25, 22],
    "МасБук": [150, 130],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [1.2, 1.2],
    "Скины КС:ГО ": [2, 2],
    "AbiBoss": [0, 0],
    "Кайф-фон-16":[110, 85],
    "Картина Лизы":[1400, 1400],
    "Айфон 1":[650, 650],
    "Часы Патэк":[800, 600],
    "Акции Татнефть": [13, 13],
    "Акции Газпрома": [16, 16],
    "Акции Яндекса": [16, 16],
    "Акции СБЕРа": [24, 24],
}

items_15 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [25, 22],
    "МасБук": [150, 130],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [1.2, 1.2],
    "Скины КС:ГО ": [2, 2],
    "AbiBoss": [0, 0],
    "Кайф-фон-16":[110, 85],
    "Картина Лизы":[1500, 1500],
    "Айфон 1":[650, 650],
    "Часы Патэк":[800, 600],
    "Акции Татнефть": [15, 15],
    "Акции Газпрома": [18, 18],
    "Акции Яндекса": [22, 22],
    "Акции СБЕРа": [26, 26],
}

items_16 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [28, 26],
    "МасБук": [150, 130],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [0.7, 0.7],
    "Скины КС:ГО ": [1, 1],
    "AbiBoss": [0, 0],
    "Кайф-фон-16":[90, 60],
    "Картина Лизы":[1450, 1450],
    "Айфон 1":[650, 650],
    "Часы Патэк":[900, 800],
    "Акции Татнефть": [17, 17],
    "Акции Газпрома": [20, 20],
    "Акции Яндекса": [20, 20],
    "Акции СБЕРа": [27, 27],
}

items_17 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [32, 30],
    "МасБук": [150, 130],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [0.7, 0.7],
    "Скины КС:ГО ": [1, 1],
    "AbiBoss": [0, 0],
    "Кайф-фон-16":[90, 60],
    "Картина Лизы":[1650, 1650],
    "Айфон 1":[850, 850],
    "Часы Патэк":[900, 800],
    "Акции Татнефть": [19, 19],
    "Акции Газпрома": [23, 23],
    "Акции Яндекса": [23, 23],
    "Акции СБЕРа": [30, 30],
}

items_18 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [34, 34],
    "МасБук": [130, 120],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [0.7, 0.7],
    "Скины КС:ГО ": [1, 1],
    "AbiBoss": [0, 0],
    "Кайф-фон-16":[90, 60],
    "Картина Лизы":[1850, 1850],
    "Айфон 1":[850, 850],
    "Часы Патэк":[900, 800],
    "Акции Татнефть": [21, 21],
    "Акции Газпрома": [25, 25],
    "Акции Яндекса": [27, 27],
    "Акции СБЕРа": [32, 32],
}

class Items:
    def __init__(self, round_number=1):
        self.items = [items_1, items_2, items_3, items_4, items_5, items_6,
                      items_7, items_8, items_9, items_10, items_11, items_12,
                      items_13, items_14, items_15, items_16, items_17, items_18]
        self.round_number = round_number

    def get_items_list(self):
        return list(self.items[self.round_number - 1].keys())

    def get_price(self, item_name, is_buy=True):
        is_buying = 0 if is_buy else 1
        return self.items[self.round_number - 1][item_name][is_buying]

items = Items(1)
