items_1 = {
    "Монета Хомяк": [1, 1],
    "Чипсы Лэйк": [5, 3],
    "Робакс": [2, 2],
    "Злой кола": [3, 3],
    "Набор Лего": [10, 10],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [6, 6]
}

items_2 = {
    "Монета Хомяк": [1, 1],
    "Чипсы Лэйк": [5, 3],
    "Робакс": [2, 2],
    "Злой кола": [3, 2],
    "Набор Лего": [12, 11],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [5, 5],
    "AbiBoss": [20, 20]
}

items_3 = {
    "Монета Хомяк": [1.2, 1.2],
    "Чипсы Лэйк": [5, 2],
    "Робакс": [3, 3],
    "Злой кола": [3, 1],
    "Набор Лего": [13, 11],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [6, 6],
    "AbiBoss": [22, 20]
}

items_4 = {
    "Монета Хомяк": [0.5, 0.5],
    "Чипсы Лэйк": [5, 1],
    "Робакс": [1, 1],
    "Злой кола": [3, 1],
    "Набор Лего": [15, 13],
    "Подписка RarWin": [4.5, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [6, 6],
    "AbiBoss": [24, 19]
}

items_5 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [16, 13],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [15, 13],
    "NFT 'Мем с котом'": [8, 8],
    "AbiBoss": [25, 20]
}

items_6 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [17, 14],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [15, 15],
    "NFT 'Мем с котом'": [12, 12],
    "AbiBoss": [25, 20],
    "Кайф-фон-16":[100, 95],
    "Акции Татнефть": [10, 10],
    "Акции Газпрома": [15, 15],
    "Акции Яндекса": [20, 20],
    "Акции СБЕРа": [25, 25],
}

items_7 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [18, 16],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [14, 14],
    "AbiBoss": [30, 18],
    "Кайф-фон-16":[100, 95],
    "Акции Татнефть": [8, 8],
    "Акции Газпрома": [12, 12],
    "Акции Яндекса": [18, 18],
    "Акции СБЕРа": [21, 21],
}

items_8 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [19, 17],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [15, 15],
    "AbiBoss": [29, 17],
    "Кайф-фон-16":[110, 85],
    "Акции Татнефть": [6, 6],
    "Акции Газпрома": [10, 10],
    "Акции Яндекса": [15, 15],
    "Акции СБЕРа": [17, 17],
}

items_9 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [22, 20],
    "МасБук": [150, 140],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [1.5, 1.5],
    "AbiBoss": [25, 15],
    "Кайф-фон-16":[110, 85],
    "Картина Лизы":[1000, 1000],
    "Айфон 1":[600, 600],
    "Часы Патэк":[700, 700],
    "Акции Татнефть": [12, 12],
    "Акции Газпрома": [15, 15],
    "Акции Яндекса": [16, 16],
    "Акции СБЕРа": [22, 22],
}

items_10 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [25, 22],
    "МасБук": [150, 140],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [1.2, 1.2],
    "AbiBoss": [0, 0],
    "Кайф-фон-16":[110, 85],
    "Картина Лизы":[1400, 1400],
    "Айфон 1":[650, 650],
    "Часы Патэк":[800, 600],
    "Акции Татнефть": [13, 13],
    "Акции Газпрома": [16, 16],
    "Акции Яндекса": [16, 16],
    "Акции СБЕРа": [24, 24],
}

items_11 = {
    "Монета Хомяк": [0, 0],
    "Чипсы Лэйк": [0, 0],
    "Робакс": [0, 0],
    "Злой кола": [0, 0],
    "Набор Лего": [25, 22],
    "МасБук": [150, 140],
    "Подписка RarWin": [0, 0],
    "Яндекс.Ровер": [0, 0],
    "NFT 'Мем с котом'": [1.2, 1.2],
    "AbiBoss": [0, 0],
    "Кайф-фон-16":[110, 85],
    "Картина Лизы":[1400, 1400],
    "Айфон 1":[650, 650],
    "Часы Патэк":[800, 600],
    "Акции Татнефть": [13, 13],
    "Акции Газпрома": [16, 16],
    "Акции Яндекса": [16, 16],
    "Акции СБЕРа": [24, 24],
}

conferention_scenery = [items_1, items_2, items_3, items_4, items_5,
                        items_6, items_7, items_8, items_9, items_10,
                        items_11]